<?php

   /*
    * -----------------------------------------------
    * 云掌财经SOA微服务框架SERVICE服务端
    * -----------------------------------------------
    * 使用框架：KURA V2.0.1
    * 开发人员：苏睿 / surui@123.com.cn
    * 最后更新日期：2017/05/07
    * -----------------------------------------------
    * SVN:
    * GIT:
    * -----------------------------------------------
    */

    //中文语言包

    return array(
        101 => '核心文件缺失：',
        102 => '普通类文件缺失：',
        103 => '插件文件缺失',
        104 => '静态资源文件缺失',
        105 => '项目已经存在，请不要重复初始化',
        106 => '项目初始化完成，请进入work目录查看项目并可以开始开发',
        201 => '没有指定平台标识',
        202 => '非法的APPID',
        203 => '非法的NONCE',
        204 => '非法的CURTIME',
        205 => '非法的OPENKEY',
        206 => 'OPENKEY已过期，请求终止！',
        207 => 'OPENKEY验证失败，请求终止！',
        208 => '路由白名单配置不存在，请检查项目下的conf.php中是否包含WHITEROUTE配置项',
        209 => '网关白名单配置不存在，请检查项目下的conf.php中是否包含WHITEGETWAY配置项',
        301 => 'MYSQL配置信息不存在，请在SOA平台为该实例进行MYSQL信息配置后重试',
        302 => '无法连接MYSQL数据库，请检查数据库地址、账号、密码是否正确',
        303 => '连接失败',
        304 => '请填写需要操作的数据表',
        305 => 'SQL语句执行错误：',
        401 => '框架所在目录层级有误，请检查index.php中的LEVEL配置是否正确',
        403 => '欢迎使用KURA，专注于接口开发的急速框架！',
        404 => '没有找到服务：',
        405 => '没有发现服务提供者，请检查路由是否存在并配置正确的指向',
        406 => '服务类不存在：',
        407 => '服务方法不存在',
        501 => 'MEMCACHEQ配置信息不存在，请在SOA平台为该实例进行MEMCACHEQ信息配置后重试',
        502 => '无法连接到MEMCACHEQ，请检查地址或端口是否配置正确',
        601 => 'REDIS配置信息不存在，请在SOA平台为该实例进行REDIS信息配置后重试',
        602 => '无法连接到REDIS，请检查地址或端口是否配置正确',
        603 => 'REDIS认证失败，请检查SOA中的密码配置是否正确',
        701 => '开发者账号不合法，请在HEADER头中以UNAME名称传递您在SOA中的开发者账号',
        702 => '密钥不合法，请在HEADER头中以TOKEN名称传递',
        703 => '开发者配置文件不存在',
        704 => '对不起，您的开发者账号不存在，请联系SOA管理人员',
        705 => '对不起，您的开发者账号已被禁用',
        706 => '实例已被禁用',
        707 => '接口测试中，请在SOA中申请上线成功后再重试',
        708 => '接口上线审核中，请等待审核成功后再重试',
        801 => 'MONGODB配置信息不存在，请在SOA平台为该实例进行MONGODB信息配置后重试',
        802 => '无法连接到MONGODB，请检查地址或端口是否配置正确',
    );